# -*- ii: y; -*-
#+TITLE: Test Writing Flow
#+AUTHOR: ii team
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+OPTIONS: toc:nil tags:nil todo:nil
#+EXPORT_SELECT_TAGS: export

*** 470: PodSpec Field Report View
    :PROPERTIES:
    :header-args:sql-mode+: :tangle ../apps/hasura/migrations/470_view_podspec_field_report.up.sql
    :END:
 #+NAME: podspec_field_hits
 #+BEGIN_SRC sql-mode
   create or replace view podspec_field_report as
   select distinct podspec_field,
         sum(other_hits) as other_hits,
         sum(e2e_hits) as e2e_hits,
         sum(conf_hits) as conf_hits,
         release,
         deprecated,
         gated,
         required,
         field_kind,
         field_type,
         bucket,
         job
   from podspec_field_mid_report
   group by podspec_field, release, deprecated, gated, required, field_kind, field_type, bucket, job
   order by conf_hits, e2e_hits, other_hits;
 #+END_SRC
 
 #+BEGIN_SRC sql-mode :results replace drawer
   select
     podspec_field, e2e_hits, pfr.job, bjs.job_timestamp
     from podspec_field_report pfr
     JOIN bucket_job_swagger bjs on(bjs.bucket = pfr.bucket AND bjs.job = pfr.job) 
    order by podspec_field;
 #+END_SRC

 #+RESULTS:
 :results:
          podspec_field         | e2e_hits |         job         |    job_timestamp    
 -------------------------------+----------+---------------------+---------------------
  activeDeadlineSeconds         |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  activeDeadlineSeconds         |        0 | live                | 2019-12-04 20:14:50
  affinity                      |        0 | live                | 2019-12-04 20:14:50
  affinity                      |     2264 | 1202311785298792448 | 2019-12-04 20:14:50
  automountServiceAccountToken  |      184 | 1202311785298792448 | 2019-12-04 20:14:50
  automountServiceAccountToken  |        0 | live                | 2019-12-04 20:14:50
  containers                    |        0 | live                | 2019-12-04 20:14:50
  containers                    |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  dnsConfig                     |        0 | live                | 2019-12-04 20:14:50
  dnsConfig                     |       32 | 1202311785298792448 | 2019-12-04 20:14:50
  dnsPolicy                     |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  dnsPolicy                     |        0 | live                | 2019-12-04 20:14:50
  enableServiceLinks            |    26592 | 1202311785298792448 | 2019-12-04 20:14:50
  enableServiceLinks            |        0 | live                | 2019-12-04 20:14:50
  ephemeralContainers           |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  ephemeralContainers           |        0 | live                | 2019-12-04 20:14:50
  hostAliases                   |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  hostAliases                   |        0 | live                | 2019-12-04 20:14:50
  hostIPC                       |        0 | live                | 2019-12-04 20:14:50
  hostIPC                       |       64 | 1202311785298792448 | 2019-12-04 20:14:50
  hostname                      |      260 | 1202311785298792448 | 2019-12-04 20:14:50
  hostname                      |        0 | live                | 2019-12-04 20:14:50
  hostNetwork                   |     6296 | 1202311785298792448 | 2019-12-04 20:14:50
  hostNetwork                   |        0 | live                | 2019-12-04 20:14:50
  hostPID                       |        0 | live                | 2019-12-04 20:14:50
  hostPID                       |       64 | 1202311785298792448 | 2019-12-04 20:14:50
  imagePullSecrets              |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  imagePullSecrets              |        0 | live                | 2019-12-04 20:14:50
  initContainers                |     3944 | 1202311785298792448 | 2019-12-04 20:14:50
  initContainers                |        0 | live                | 2019-12-04 20:14:50
  nodeName                      |    18476 | 1202311785298792448 | 2019-12-04 20:14:50
  nodeName                      |        0 | live                | 2019-12-04 20:14:50
  nodeSelector                  |     2252 | 1202311785298792448 | 2019-12-04 20:14:50
  nodeSelector                  |        0 | live                | 2019-12-04 20:14:50
  overhead                      |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  overhead                      |        0 | live                | 2019-12-04 20:14:50
  preemptionPolicy              |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  preemptionPolicy              |        0 | live                | 2019-12-04 20:14:50
  priority                      |      180 | 1202311785298792448 | 2019-12-04 20:14:50
  priority                      |        0 | live                | 2019-12-04 20:14:50
  priorityClassName             |        0 | live                | 2019-12-04 20:14:50
  priorityClassName             |      128 | 1202311785298792448 | 2019-12-04 20:14:50
  readinessGates                |        0 | live                | 2019-12-04 20:14:50
  readinessGates                |       32 | 1202311785298792448 | 2019-12-04 20:14:50
  restartPolicy                 |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  restartPolicy                 |        0 | live                | 2019-12-04 20:14:50
  runtimeClassName              |        0 | live                | 2019-12-04 20:14:50
  runtimeClassName              |      184 | 1202311785298792448 | 2019-12-04 20:14:50
  schedulerName                 |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  schedulerName                 |        0 | live                | 2019-12-04 20:14:50
  securityContext               |        0 | live                | 2019-12-04 20:14:50
  securityContext               |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  serviceAccount                |     5244 | 1202311785298792448 | 2019-12-04 20:14:50
  serviceAccount                |        0 | live                | 2019-12-04 20:14:50
  serviceAccountName            |     5244 | 1202311785298792448 | 2019-12-04 20:14:50
  serviceAccountName            |        0 | live                | 2019-12-04 20:14:50
  shareProcessNamespace         |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  shareProcessNamespace         |        0 | live                | 2019-12-04 20:14:50
  subdomain                     |        0 | live                | 2019-12-04 20:14:50
  subdomain                     |      260 | 1202311785298792448 | 2019-12-04 20:14:50
  terminationGracePeriodSeconds |    44772 | 1202311785298792448 | 2019-12-04 20:14:50
  terminationGracePeriodSeconds |        0 | live                | 2019-12-04 20:14:50
  tolerations                   |      180 | 1202311785298792448 | 2019-12-04 20:14:50
  tolerations                   |        0 | live                | 2019-12-04 20:14:50
  topologySpreadConstraints     |        0 | live                | 2019-12-04 20:14:50
  topologySpreadConstraints     |        0 | 1202311785298792448 | 2019-12-04 20:14:50
  volumes                       |    27044 | 1202311785298792448 | 2019-12-04 20:14:50
  volumes                       |        0 | live                | 2019-12-04 20:14:50
 (68 rows)

 :end:

*** 495: full_podspec_field_coverage
    :PROPERTIES:
    :header-args:sql-mode+: :tangle ../apps/hasura/migrations/495_full_podspec_field_coverage.up.sql
    :END:
    And we can create a view from this
    #+NAME: full_podspec_field_coverage
    #+BEGIN_SRC sql-mode
     CREATE OR REPLACE VIEW "public"."full_podspec_field_coverage" AS
      select * from full_podspec_field_coverage_material;
    #+END_SRC
   
   
    When using the view, you will want ot make sure to limit it by a job, otherwise you'll get massive results.
   
    for example


     #+begin_src sql-mode :results replace code :wrap EXAMPLE
     \d+ full_podspec_field_coverage;
     #+end_src

     #+RESULTS:
     #+begin_EXAMPLE
                        View "public.full_podspec_field_coverage"
        Column   |  Type   | Collation | Nullable | Default | Storage  | Description 
     ------------+---------+-----------+----------+---------+----------+-------------
      kind       | text    |           |          |         | extended | 
      sub_kind   | text    |           |          |         | extended | 
      field_path | text    |           |          |         | extended | 
      distance   | integer |           |          |         | plain    | 
      test_hits  | bigint  |           |          |         | plain    | 
      conf_hits  | bigint  |           |          |         | plain    | 
      field_kind | text    |           |          |         | extended | 
      job        | text    |           |          |         | extended | 
      bucket     | text    |           |          |         | extended | 
     View definition:
      SELECT full_podspec_field_coverage_material.kind,
         full_podspec_field_coverage_material.sub_kind,
         full_podspec_field_coverage_material.field_path,
         full_podspec_field_coverage_material.distance,
         full_podspec_field_coverage_material.test_hits,
         full_podspec_field_coverage_material.conf_hits,
         full_podspec_field_coverage_material.field_kind,
         full_podspec_field_coverage_material.job,
         full_podspec_field_coverage_material.bucket
        FROM full_podspec_field_coverage_material;

     #+end_EXAMPLE
    #+name: kind_field_coverage_nolive
    #+begin_src sql-mode
      CREATE OR REPLACE VIEW "public"."kind_field_path_coverage" AS
       select * from kind_field_path_coverage_material where job != 'live';
      refresh materialized view kind_field_path_coverage_material; 
    #+end_src
    #+name: full_podspec_field_coverage_nolive
    #+begin_src sql-mode
      CREATE OR REPLACE VIEW "public"."full_podspec_field_path_coverage" AS
       select * from kind_field_path_coverage_material where job != 'live';
      refresh materialized view full_podspec_field_path_coverage_material; 
    #+end_src

   
